PureEngineering/PUREmodules/nrf52/modules_examples/ble_app_uart/main.c
static void send_ble_data(){
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    //uint32_t       err_code;

    data_array[0] = 'a';
    index++;
    data_array[1] = 'b';
    index++;
    data_array[2] = 'c';
    index++;
    data_array[3] = 'd';
    index++;
    ble_nus_string_send(&m_nus, data_array, index);

    //err_code = ble_nus_string_send(&m_nus, data_array, index);

    nrf_delay_ms(2000);
}

#define TWI0_USE_EASY_DMA 0


/**
 * @brief TWI master instance
 *
 * Instance of TWI master driver that would be used for communication with simulated
 * eeprom memory.
 */
//TW0_USE_EAY added in nrf_drv_twi line 80
static const nrf_drv_twi_t m_twi_master = NRF_DRV_TWI_INSTANCE(MASTER_TWI_INST);


/**
 * @brief Initialize the master TWI
 *
 * Function used to initialize master TWI interface that would communicate with simulated EEPROM.
 *
 * @return NRF_SUCCESS or the reason of failure
 */
static ret_code_t twi_master_init(void)
{
    ret_code_t ret;
    const nrf_drv_twi_config_t config =
    {
       .scl                = TWI_SCL_M,
       .sda                = TWI_SDA_M,
       .frequency          = NRF_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    ret = nrf_drv_twi_init(&m_twi_master, &config, NULL, NULL);

    if (NRF_SUCCESS == ret)
    {
        nrf_drv_twi_enable(&m_twi_master);
    }

    return ret;
}


uint8_t ORIENTATION_X = 0;
uint8_t ORIENTATION_Y = 1;
uint8_t ORIENTATION_Z = 2;

bool did_sign_change(int value, int prev_value){
    if (value >= 0){
        return prev_value < 0;
    }
    else{
        return prev_value >= 0;
    }
}


uint8_t check_orientation(int x_cycle_count, int y_cycle_count, int z_cycle_count){
    if(x_cycle_count>=y_cycle_count){
        if(x_cycle_count>=z_cycle_count){
            return ORIENTATION_X;
        }
        else{
            return ORIENTATION_Z;
        }
    }
    else{
        if(y_cycle_count>=z_cycle_count){
            return ORIENTATION_Y;
        }
        else{
            return ORIENTATION_Z;
        }
    }
}

int step_incrementer(int step_count, uint8_t current_orientation, bool x_changed, bool y_changed,bool z_changed){

    if(current_orientation==ORIENTATION_X){
        if(x_changed){
            bsp_board_led_invert(0);
            return step_count + 1;
        }
        else{
            return step_count;
        }
    }
    else if(current_orientation==ORIENTATION_Y){
        if(y_changed){
            bsp_board_led_invert(0);
            return step_count + 1;
        }
        else{
            return step_count;
        }
    }
    else{
        if(z_changed){
            bsp_board_led_invert(0);
            return step_count + 1;
        }
        else{
            return step_count;
        }
    }
}



void lis2de_stepcounter(){
    int x_cycle_count = 0;
    int y_cycle_count = 0;
    int z_cycle_count = 0;

    int8_t prev_outx = 0;
    int8_t prev_outy = 0;
    int8_t prev_outz = 0;

    bool x_changed = 0; 
    bool y_changed = 0;
    bool z_changed = 0;

    uint8_t current_orientation = 0;

    int step_count = 0;

    while(1){


    int8_t outx =  lis2de_readOUT_X(m_twi_master);
    int8_t outy =  lis2de_readOUT_Y(m_twi_master);
    int8_t outz =  lis2de_readOUT_Z(m_twi_master);

    current_orientation = check_orientation(x_cycle_count,y_cycle_count,z_cycle_count);

    if(did_sign_change(outx, prev_outx)){
        x_changed = 1;
        x_cycle_count++;
    }
    else{
        x_changed = 0;
    }
    if(did_sign_change(outy, prev_outy)){
        y_changed = 1;
        y_cycle_count++;
    }
    else{
        y_changed = 0;
    }
    if(did_sign_change(outz, prev_outz)){
        z_changed = 1;
        z_cycle_count++;
    }
    else{
        z_changed = 0;
    }

    step_count = step_incrementer(step_count, current_orientation, x_changed, y_changed, z_changed);



    prev_outx = outx;
    prev_outy = outy;
    prev_outz = outz;

    //NRF_LOG_RAW_INFO("-----------------------");
    NRF_LOG_RAW_INFO("STEP Count : %x.\r\n\r\n", step_count);
    //NRF_LOG_RAW_INFO("Orientation: %x.\r\n", current_orientation);
    //NRF_LOG_RAW_INFO("X cycle    : %x.\r\n", x_cycle_count);
    //NRF_LOG_RAW_INFO("Y cycle    : %x.\r\n", y_cycle_count);
    //NRF_LOG_RAW_INFO("Z cycle    : %x.\r\n", z_cycle_count);

    nrf_delay_ms(100);
    NRF_LOG_FLUSH();
    }
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    bsp_board_leds_init();

    /* Initializing TWI master interface for SuperSensor */
    err_code = twi_master_init();
    APP_ERROR_CHECK(err_code);

    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);



    //lis2de_init(m_twi_master);


    bool run_ble = false;
    NRF_LOG_FLUSH();

    // Enter main loop.
    for (;;)
    {
        
        if(run_ble){
            lis2de_stepcounter();
            send_ble_data();
        }

        //power_manage();
    }
}


/**
 * @}
 */
